Revit 2027 API
Outline.AddPoint Method
 Adds a point to the bounding box, expanding it if the point is outside the existing boundary.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddPoint(
	XYZ point
)
Public Sub AddPoint (
	point As XYZ
)
public:
void AddPoint(
	XYZ^ point
)
member AddPoint :
        point : XYZ -> unit
Parameters
point XYZ
 The point to add.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Outline Class
Autodesk.Revit.DB Namespace